#include <stdio.h>
#include "menu.h"

int menu() {
    int input;
    printf(" ________  ________   ________  ___  __    _______      \n");
    printf("|\\   ____\\|\\   ___  \\|\\   __  \\|\\  \\|\\  \\ |\\  ___ \\     \n");
    printf("\\ \\  \\___|\\ \\  \\\\ \\  \\ \\  \\|\\  \\ \\  \\/  /|\\ \\   __/|    \n");
    printf(" \\ \\_____  \\ \\  \\\\ \\  \\ \\   __  \\ \\   ___  \\ \\  \\_|/__  \n");
    printf("  \\|____|\\  \\ \\  \\\\ \\  \\ \\  \\ \\  \\ \\  \\\\ \\  \\ \\  \\_|\\ \\     \n");
    printf("    ____\\_\\  \\ \\__\\\\ \\__\\ \\__\\ \\__\\ \\__\\\\ \\__\\ \\_______\\\n");
    printf("   |\\_________\\|__| \\|__|\\|__|\\|__|\\|__| \\|__|\\|_______|\n");
    printf("   \\|_________|                                         \n");
    printf("------贪吃蛇-第一版------\n");
    printf("输入1开始游戏\n");
    printf("输入2查看关于\n");
    printf("输入3查看最高分数\n");
    printf("输入4查看帮助\n");
    printf("输入其他数字退出\n");
    scanf("%d", &input);
    return input;
}

void about() {
    printf("程序名称:贪吃蛇\n");
    printf("作者:计算机二类2307班古佳乐8008123201\n");
    printf("版本:第一版\n");
    printf("开发时间:2024年1月1日\n");
}

void score() {
    FILE *f = fopen("score.txt", "r");
    int score = 0;
    fscanf(f,"%d", &score);
    
    printf("最高分数: %d\n", score);
    fclose(f);
}

void help()
{
    printf("w,a,s,d分别控制上左下右,撞到身体或墙壁游戏结束\n");
}