#include <stdio.h>
#include "menu.h"

int menu() {
    int input;
    printf(" ________  ________   ________  ___  __    _______      \n");
    printf("|\\   ____\\|\\   ___  \\|\\   __  \\|\\  \\|\\  \\ |\\  ___ \\     \n");
    printf("\\ \\  \\___|\\ \\  \\\\ \\  \\ \\  \\|\\  \\ \\  \\/  /|\\ \\   __/|    \n");
    printf(" \\ \\_____  \\ \\  \\\\ \\  \\ \\   __  \\ \\   ___  \\ \\  \\_|/__  \n");
    printf("  \\|____|\\  \\ \\  \\\\ \\  \\ \\  \\ \\  \\ \\  \\\\ \\  \\ \\  \\_|\\ \\     \n");
    printf("    ____\\_\\  \\ \\__\\\\ \\__\\ \\__\\ \\__\\ \\__\\\\ \\__\\ \\_______\\\n");
    printf("   |\\_________\\|__| \\|__|\\|__|\\|__|\\|__| \\|__|\\|_______|\n");
    printf("   \\|_________|                                         \n");
    printf("输入1开始游戏\n");
    printf("输入2查看信息\n");
    printf("输入3查看最高分数\n");
    scanf("%d", &input);
    return input;
}

void about() {
    printf("计算机二类2307班古佳乐8008123201\n");
}

void score() {
    FILE *f = fopen("score.txt", "r");
    int score = 0;
    fscanf(f,"%d", &score);
    
    printf("最高分数: %d\n", score);
    fclose(f);
}